tutorials/CFD/27SmagorinskyHyperreduction/0/fullStressFunction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      fullStressFunction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
11644
(
(4.0351613e-08 -7.1079633e-09 0)
(2.6766728e-08 -1.8497852e-08 0)
(1.7338495e-08 -2.5545668e-08 0)
(8.9767153e-09 -3.0364861e-08 0)
(1.8750253e-09 -3.4343726e-08 0)
(-4.1665217e-09 -3.827299e-08 0)
(-9.1116039e-09 -4.2399698e-08 0)
(-1.2743595e-08 -4.6937175e-08 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
40
(
(4.0351613e-08 -7.1079633e-09 0)
(2.6766728e-08 -1.8497852e-08 0)
(1.7338495e-08 -2.5545668e-08 0)
(8.9767153e-09 -3.0364861e-08 0)
(1.8750253e-09 -3.4343726e-08 0)
(-4.1665217e-09 -3.827299e-08 0)
(-9.1116039e-09 -4.2399698e-08 0)
(-1.2743595e-08 -4.6937175e-08 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
40
(
(5.9783715e-07 9.0525549e-08 0)
(7.2561145e-07 2.2951073e-07 0)
(9.8862016e-07 4.4591455e-07 0)
(1.4184095e-06 8.0488638e-07 0)
(2.0855651e-06 1.3805634e-06 0)
(3.0376862e-06 2.2510291e-06 0)
(4.316076e-06 3.4896012e-06 0)
(5.9560127e-06 5.1546808e-06 0)
...
)
;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            symmetryPlane;
    }
    sides
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
200
(
(4.0351613e-08 -7.1079633e-09 0)
(4.4332748e-08 7.5782737e-09 0)
(1.1728689e-07 -1.1806189e-08 0)
(1.2282566e-07 1.1870989e-08 0)
(1.9951666e-07 -1.2428559e-08 0)
(1.9476842e-07 1.1266435e-08 0)
(2.7728791e-07 -1.3840395e-08 0)
(2.5044509e-07 1.1536406e-08 0)
...
)
;
    }
    cylinder1
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
318
(
(0.010852864 0.0011750941 1.3922946e-19)
(0.013718988 0.0025882856 -5.0446048e-19)
(0.025353171 -0.0049446872 2.3086511e-18)
(0.020588924 -0.002419897 6.9000803e-19)
(0.17306137 -0.34325474 2.2901817e-18)
(0.084148995 0.1137665 -1.1045966e-18)
(0.10051843 -0.012745188 2.6568384e-18)
(0.07652734 -0.10394245 2.5773961e-18)
...
)
;
    }
}

