tutorials/CFD/27SmagorinskyHyperreduction/0/nut0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{

inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            symmetryPlane;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
